#+TITLE: Ryan's Time Log
#+AUTHOR: Ryan Szemplinski
#+DATE: Spring 2014
#+STARTUP: content indent logdrawer lognoteclock-out lognotedone

*** DONE Class time for the week of the 16th                     :rszempli:
CLOSED: [2014-02-27 Thu 13:51]
:LOGBOOK:
- CLOSING NOTE [2014-02-27 Thu 13:51] \\
  Week is over
CLOCK: [2014-02-20 Thu 15:17]--[2014-02-20 Thu 17:00] =>  1:43
- And again even more class time.
:END:
CLOCK: [2014-02-18 Tue 15:22]--[2014-02-18 Tue 15:50] =>  0:28
- Some more class time
CLOCK: [2014-02-18 Tue 14:57]--[2014-02-18 Tue 15:20] =>  0:23
- More class time
CLOCK: [2014-02-18 Tue 13:40]--[2014-02-18 Tue 14:32] =>  0:52
- Class time
*** DONE Django tutorials                                        :rszempli
:LOGBOOK:
- CLOSING NOTE [2014-02-27 Thu 13:51] \\
  Finished
:END:
**** DONE Go through the main site tutorial [5/5] [100%]
CLOSED: [2014-02-23 Sun 15:06]
:LOGBOOK:
- CLOSING NOTE [2014-02-23 Sun 15:06] \\
  Finished all them tutorials on django webpage
CLOCK: [2014-02-19 Wed 22:06]--[2014-02-19 Wed 23:39] =>  1:33
- Learned some about making some models and the very sexy database viewer
  web page thing and some url stuffzzzz....
:END:
- [X] Part 1
- [X] Part 2
- [X] Part 3
- [X] Part 4
- [X] Part 5
*** TODO Get more experience with org-mode                       :rszempli:
**** TODO Look at more tutorials on it[1/3]
- [X] Learn more hotkeys
- [ ] Memorize the hotkeys
- [ ] Learn to like org-mode
      - I don't think this is possible
*** TODO Tutorial on Angular.js [[http://docs.angularjs.org/api][Documentation]]                    :rszempli
*** DONE Work on Project CRUD
CLOSED: [2014-03-08 Sat 13:18]
:LOGBOOK:
- CLOSING NOTE [2014-03-08 Sat 13:18] \\
  Finished all of the project crud and finished some tests
CLOCK: [2014-03-03 Mon 19:35]--[2014-03-03 Mon 22:12] =>  2:37
- Worked a little with Ben on some tests for the project CRUD
CLOCK: [2014-02-27 Thu 13:56]--[2014-02-27 Thu 15:50] =>  1:54
- Working on some CRUD stuff for projects with my roomie BEN
CLOCK: [2014-02-23 Sun 15:06]--[2014-02-23 Sun 16:48] =>  1:42
- Trying to get the forms to work for projects but failed to understand how everything
  links up in our project. Me and Ben need to talk to Dustin or someone.
:END:
*** DONE Class time week of the 23rd                             :rszempli:
CLOSED: [2014-03-15 Sat 16:05]
:LOGBOOK:
- CLOSING NOTE [2014-03-15 Sat 16:05]
CLOCK: [2014-02-27 Thu 13:49]--[2014-02-27 Thu 16:00] =>  2:11
- Thursday Class time
CLOCK: [2014-02-25 Tue 14:00]--[2014-02-25 Tue 16:00] =>  2:00
- Tuesday Class time
:END:
*** DONE Class time week of the 3rd
CLOSED: [2014-03-15 Sat 16:05]
:LOGBOOK:
- CLOSING NOTE [2014-03-15 Sat 16:05]
- CLOSING NOTE [2014-03-08 Sat 13:12]
CLOCK: [2014-03-06 Thu 14:00]--[2014-03-06 Thu 16:00] =>  2:00
- Finished Thursdays class
CLOCK: [2014-03-04 Tue 14:00]--[2014-03-04 Tue 16:00] =>  2:00
- Finished class
:END: 
*** DONE Work on User Stuff
CLOSED: [2014-03-09 Sun 21:50]
:LOGBOOK:
- CLOSING NOTE [2014-03-09 Sun 21:50]
:END:
**** DONE User basics [3/3]
CLOSED: [2014-03-09 Sun 21:50]
:LOGBOOK:
- CLOSING NOTE [2014-03-09 Sun 21:50]
CLOCK: [2014-03-09 Sun 19:55]--[2014-03-09 Sun 21:49] =>  1:54
- Worked on finshing users and starting the glosses which can't be
  until we have part of speech done
CLOCK: [2014-03-08 Sat 13:21]--[2014-03-08 Sat 14:02] =>  0:41
- Having some problem with user on base.html right now
:END:
- [X] Build login page
- [X] If successful login redirect to home
- [X] Make it functional with navbar
  - Having some trouble because our homepage
    right now
*** DONE Class time week of the 10th
CLOSED: [2014-03-15 Sat 16:05]
:LOGBOOK:
- CLOSING NOTE [2014-03-15 Sat 16:05]
CLOCK: [2014-03-13 Thu 14:00]--[2014-03-13 Thu 16:04] =>  2:04
- Class time
CLOCK: [2014-03-11 Tue 14:00]--[2014-03-11 Tue 16:03] =>  2:03
- Class time
:END:
*** TODO Gloss Stuff
**** TODO Get basic CRUD functionality
:LOGBOOK:
CLOCK: [2014-03-12 Wed 18:05]--[2014-03-12 Wed 19:40] =>  1:35
:END:
**** DONE Fix Part of Speech
CLOSED: [2014-03-15 Sat 16:09]
:LOGBOOK:
- CLOSING NOTE [2014-03-15 Sat 16:09]
:END:
**** TODO Learn about formsets
:LOGBOOK:
CLOCK: [2014-03-15 Sat 16:08]--[2014-03-15 Sat 17:09] =>  1:01
:END:
*** DONE Class time week of the 17th
CLOSED: [2014-04-01 Tue 13:48]
:LOGBOOK:
- CLOSING NOTE [2014-04-01 Tue 13:48] \\
  This week is over!
CLOCK: [2014-03-20 Thu 13:44]--[2014-03-20 Thu 16:00] =>  2:16
- Thursday done and over with
CLOCK: [2014-03-18 Tue 13:35]--[2014-03-18 Tue 16:00] =>  2:25
- Tuesday done and over with
:END:
*** DONE Class time week of the 31st
CLOSED: [2014-04-08 Tue 13:52]
:LOGBOOK:
- CLOSING NOTE [2014-04-08 Tue 13:52]
CLOCK: [2014-04-03 Thu 13:55]--[2014-04-03 Thu 16:00] =>  2:05
- Class time over!
CLOCK: [2014-04-01 Tue 13:49]--[2014-04-01 Tue 15:55] =>  2:06
:END:
*** TODO Class time week of the 7th
:LOGBOOK:
CLOCK: [2014-04-10 Thu 19:34]--[2014-04-10 Thu 20:55] =>  1:21
- Worked on the dictionary page and the glosses with jquery stuff
CLOCK: [2014-04-08 Tue 13:55]--[2014-04-08 Tue 16:00] =>  2:05
- Class time (8th)
CLOCK: [2014-04-06 Sun 17:35]--[2014-04-06 Sun 18:40] =>  1:05
- Working with ben
CLOCK: [2014-04-07 Mon 19:00]--[2014-04-07 Mon 20:25] =>  1:25
- Working with dustin
:END:
*** TODO JQuery Tutorials
**** TODO Some Videos
:LOGBOOK:
CLOCK: [2014-04-09 Wed 15:41]--[2014-04-09 Wed 16:18] =>  0:37
CLOCK: [2014-04-08 Tue 16:39]--[2014-04-08 Tue 17:10] =>  0:31
:END:
**** TODO Some Documentation
:LOGBOOK:
CLOCK: [2014-04-12 Sat 17:24]--[2014-04-12 Sat 19:30] =>  2:06
- Some more document stuff and some videos as well
CLOCK: [2014-04-09 Wed 19:42]--[2014-04-09 Wed 20:05] =>  0:23
- Ajax stuffz
:END:
*** TODO Class time week of the 14th
:LOGBOOK:
CLOCK: [2014-04-15 Tue 13:22]--[2014-04-15 Tue 16:00] =>  2:38
:END:
